vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA152_DFP.pdsc
    <condition id="cores.cm33.internal_condition">
      <accept Dcore="Cortex-M33"/>
    </condition>
    <condition id="driver.crc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.ctimer.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.edma4.condition_id">
      <require condition="allOf.driver.edma_soc, device=MCXA152.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma_soc, device=MCXA152.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma_soc"/>
      <require condition="device.MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.edma_soc.condition_id">
      <require condition="allOf.driver.edma4, device=MCXA152.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, device=MCXA152.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.eim.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.eqdc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.erm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.fxas21002cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA152.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA152.internal_condition">
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXA152.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpi2c.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.glikey.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.gpio.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.i3c.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.i3c_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.i3c, device=MCXA152.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, driver.i3c, device=MCXA152.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require condition="device.MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.inputmux.condition_id">
      <require condition="allOf.driver.common, driver.inputmux_connections, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.inputmux_connections, device_id=MCXA152.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
      <require condition="device_id.MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.inputmux_connections.condition_id">
      <require condition="allOf.device=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.lpadc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.lpc_freqme.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.lpcmp.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c_edma.condition_id">
      <require condition="allOf.driver.edma4, device=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.lpspi.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.lpspi_edma.condition_id">
      <require condition="allOf.driver.edma4, device=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.lptmr.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA152.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_edma.condition_id">
      <require condition="allOf.driver.edma4, device=MCXA152.internal_condition"/>
    </condition>
